SparkysWidgets/Arduino/hardware/arduino/avr/boards.txt
# See: http://code.google.com/p/arduino/wiki/Platforms

menu.cpu=Processor

##############################################################

leophi.name=Leophi
leophi.vid.0=0x1D50
leophi.pid.0=0x6016
leophi.vid.1=0x1D50
leophi.pid.1=0x8016
leophi.upload.tool=avrdude
leophi.upload.protocol=avr109
leophi.upload.maximum_size=28672
leophi.upload.maximum_data_size=2560
leophi.upload.speed=57600
leophi.upload.disable_flushing=true
leophi.upload.use_1200bps_touch=true
leophi.upload.wait_for_upload_port=true

leophi.bootloader.tool=avrdude
leophi.bootloader.low_fuses=0xff
leophi.bootloader.high_fuses=0xd8
leophi.bootloader.extended_fuses=0xcb
leophi.bootloader.file=caterina-LeoPhi/Caterina-LeoPhi.hex
leophi.bootloader.unlock_bits=0x3F
leophi.bootloader.lock_bits=0x2F

leophi.build.mcu=atmega32u4
leophi.build.f_cpu=16000000L
leophi.build.vid=0x1D50
leophi.build.pid=0x8016
leophi.build.usb_product="LeoPhi"
leophi.build.board=AVR_LEOPHI
leophi.build.core=arduino
leophi.build.variant=leophi
leophi.build.extra_flags={build.usb_flags}

##############################################################

Leoec.name=Leoec
Leoec.vid.0=0x0DA0
Leoec.pid.0=0x6017
Leoec.vid.1=0x0DA0
Leoec.pid.1=0x8017
Leoec.upload.tool=avrdude
Leoec.upload.protocol=avr109
Leoec.upload.maximum_size=28672
Leoec.upload.maximum_data_size=2560
Leoec.upload.speed=57600
Leoec.upload.disable_flushing=true
Leoec.upload.use_1200bps_touch=true
Leoec.upload.wait_for_upload_port=true

Leoec.bootloader.tool=avrdude
Leoec.bootloader.low_fuses=0xff
Leoec.bootloader.high_fuses=0xd8
Leoec.bootloader.extended_fuses=0xcb
Leoec.bootloader.file=caterina-LeoEc/Caterina-LeoEc.hex
Leoec.bootloader.unlock_bits=0x3F
Leoec.bootloader.lock_bits=0x2F

Leoec.build.mcu=atmega32u4
Leoec.build.f_cpu=16000000L
Leoec.build.vid=0x0DA0
Leoec.build.pid=0x8017
Leoec.build.usb_product="LeoeC USB eC"
Leoec.build.board=AVR_LEOEC
Leoec.build.core=arduino
Leoec.build.variant=leoec
Leoec.build.extra_flags={build.usb_flags}

##############################################################

yun.name=Arduino Yún
yun.upload.via_ssh=true

yun.vid.0=0x2341
yun.pid.0=0x0041
yun.vid.1=0x2341
yun.pid.1=0x8041
yun.vid.2=0x2A03
yun.pid.2=0x0041
yun.vid.3=0x2A03
yun.pid.3=0x8041

yun.vid.0x2A03.warning=Uncertified

yun.upload.tool=avrdude
yun.upload.protocol=avr109
yun.upload.maximum_size=28672
yun.upload.maximum_data_size=2560
yun.upload.speed=57600
yun.upload.disable_flushing=true
yun.upload.use_1200bps_touch=true
yun.upload.wait_for_upload_port=true

yun.bootloader.tool=avrdude
yun.bootloader.low_fuses=0xff
yun.bootloader.high_fuses=0xd8
yun.bootloader.extended_fuses=0xfb
yun.bootloader.file=caterina/Caterina-Yun.hex
yun.bootloader.unlock_bits=0x3F
yun.bootloader.lock_bits=0x2F

yun.build.mcu=atmega32u4
yun.build.f_cpu=16000000L
yun.build.vid=0x2341
yun.build.pid=0x8041
yun.build.usb_product="Arduino Yun"
yun.build.board=AVR_YUN
yun.build.core=arduino
yun.build.variant=yun
yun.build.extra_flags={build.usb_flags}

##############################################################

uno.name=Arduino Uno

uno.vid.0=0x2341
uno.pid.0=0x0043
uno.vid.1=0x2341
uno.pid.1=0x0001
uno.vid.2=0x2A03
uno.pid.2=0x0043

uno.vid.0x2A03.warning=Uncertified

uno.upload.tool=avrdude
uno.upload.protocol=arduino
uno.upload.maximum_size=32256
uno.upload.maximum_data_size=2048
uno.upload.speed=115200

uno.bootloader.tool=avrdude
uno.bootloader.low_fuses=0xFF
uno.bootloader.high_fuses=0xDE
uno.bootloader.extended_fuses=0x05
uno.bootloader.unlock_bits=0x3F
uno.bootloader.lock_bits=0x0F
uno.bootloader.file=optiboot/optiboot_atmega328.hex

uno.build.mcu=atmega328p
uno.build.f_cpu=16000000L
uno.build.board=AVR_UNO
uno.build.core=arduino
uno.build.variant=standard

##############################################################

diecimila.name=Arduino Duemilanove or Diecimila

diecimila.upload.tool=avrdude
diecimila.upload.protocol=arduino

diecimila.bootloader.tool=avrdude
diecimila.bootloader.low_fuses=0xFF
diecimila.bootloader.unlock_bits=0x3F
diecimila.bootloader.lock_bits=0x0F

diecimila.build.f_cpu=16000000L
diecimila.build.board=AVR_DUEMILANOVE
diecimila.build.core=arduino
diecimila.build.variant=standard

## Arduino Duemilanove or Diecimila w/ ATmega328
## ---------------------------------------------
diecimila.menu.cpu.atmega328=ATmega328

diecimila.menu.cpu.atmega328.upload.maximum_size=30720
diecimila.menu.cpu.atmega328.upload.maximum_data_size=2048
diecimila.menu.cpu.atmega328.upload.speed=57600

diecimila.menu.cpu.atmega328.bootloader.high_fuses=0xDA
diecimila.menu.cpu.atmega328.bootloader.extended_fuses=0x05
diecimila.menu.cpu.atmega328.bootloader.file=atmega/ATmegaBOOT_168_atmega328.hex

diecimila.menu.cpu.atmega328.build.mcu=atmega328p

## Arduino Duemilanove or Diecimila w/ ATmega168
## ---------------------------------------------
diecimila.menu.cpu.atmega168=ATmega168

diecimila.menu.cpu.atmega168.upload.maximum_size=14336
diecimila.menu.cpu.atmega168.upload.maximum_data_size=1024
diecimila.menu.cpu.atmega168.upload.speed=19200

diecimila.menu.cpu.atmega168.bootloader.high_fuses=0xdd
diecimila.menu.cpu.atmega168.bootloader.extended_fuses=0x00
diecimila.menu.cpu.atmega168.bootloader.file=atmega/ATmegaBOOT_168_diecimila.hex

diecimila.menu.cpu.atmega168.build.mcu=atmega168

##############################################################

nano.name=Arduino Nano

nano.upload.tool=avrdude
nano.upload.protocol=arduino

nano.bootloader.tool=avrdude
nano.bootloader.unlock_bits=0x3F
nano.bootloader.lock_bits=0x0F

nano.build.f_cpu=16000000L
nano.build.board=AVR_NANO
nano.build.core=arduino
nano.build.variant=eightanaloginputs

## Arduino Nano w/ ATmega328
## -------------------------
nano.menu.cpu.atmega328=ATmega328

nano.menu.cpu.atmega328.upload.maximum_size=30720
nano.menu.cpu.atmega328.upload.maximum_data_size=2048
nano.menu.cpu.atmega328.upload.speed=57600

nano.menu.cpu.atmega328.bootloader.low_fuses=0xFF
nano.menu.cpu.atmega328.bootloader.high_fuses=0xDA
nano.menu.cpu.atmega328.bootloader.extended_fuses=0x05
nano.menu.cpu.atmega328.bootloader.file=atmega/ATmegaBOOT_168_atmega328.hex

nano.menu.cpu.atmega328.build.mcu=atmega328p

## Arduino Nano w/ ATmega168
## -------------------------
nano.menu.cpu.atmega168=ATmega168

nano.menu.cpu.atmega168.upload.maximum_size=14336
nano.menu.cpu.atmega168.upload.maximum_data_size=1024
nano.menu.cpu.atmega168.upload.speed=19200

